{
  "movies": [
    {
      "id": 1,
      "genre": "action",
      "imdb_id": "tt0068909",
      "title": "Man of La Mancha",
      "plot": "In the sixteenth century, Miguel de Cervantes, poet, playwright, and part-time actor, has been arrested, together with his manservant, by the Spanish Inquisition. They are accused of presenting an entertainment offensive to the Inquisition. Inside the huge dungeon into which they have been cast, the other prisoners gang up on Cervantes and his manservant, and begin a mock trial, with the intention of stealing or burning his possessions. Cervantes wishes to desperately save a manuscript he carries with him and stages, with costumes, makeup, and the participation of the other prisoners, an unusual defense--the story of Don Quixote."
    },
    {
      "id": 2,
      "genre": "action",
      "imdb_id": "tt0092099",
      "title": "Top Gun",
      "plot": "For Lieutenant Pete 'Maverick' Mitchell and his friend and Co-Pilot Nick 'Goose' Bradshaw being accepted into an elite training school for fighter pilots is a dream come true.  A tragedy, as well as personal demons, threaten Pete's dreams of becoming an Ace pilot."
    },
    {
      "id": 3,
      "genre": "action",
      "imdb_id": "tt1890493",
      "title": "Oosaravelli",
      "plot": "Tony (NTR) is a wily youngster who does illegal things for money. He falls in love with Niharika (Tamanna) during a freak incident. He keeps following her and proposing to her. But she is engaged to some other rich guy. Tony has a secret mission and he is in hot pursuit of somebody. The rest of the story is all about the love story between the lead pair and how Tony achieved his mission."
    },
    {
      "id": 4,
      "genre": "action",
      "imdb_id": "tt0416871",
      "title": "Jade Warrior",
      "plot": "Thousands of years ago in ancient China, a love struck sword hero fights against his destiny. He wants another chance to be reunited with his loved one and he gets that chance, in a far away place and a far away time, in the cold north, in modern Finland. Jade Warrior is set in ancient China early iron age and present day Finland. The past is feeding the story in present day, slowly revealing our warrior his real origin, his superior skills and his destiny. Jade Warrior - the first Finnish Kung Fu film - combines Finnish and Chinese mythologies into one film. Jade Warrior is an homage to Kung Fu genre strongly spiced with a truly original approach to Finnish national epic Kalevala. Like Kalevala Jade Warrior is a pure melodrama. A story of Kalevala's greatest hero. Written by www.ses.fi"
    },
    {
      "id": 5,
      "genre": "action",
      "imdb_id": "tt0048729",
      "title": "To Hell and Back",
      "plot": "The true WWII story of Audie Murphy, the most decorated soldier in U.S. history. Based on the autobiography of Audie Murphy who stars as himself in the film."
    },
    {
      "id": 6,
      "genre": "action",
      "imdb_id": "tt0254683",
      "title": "Phool Aur Kaante",
      "plot": "Phool Aur Kaante (English: Flowers and Thorns) is a Hindi action romance film released in 1991. It stars Ajay Devgn, Madhoo, Aruna Irani, Jagdeep and Amrish Puri among others. The film marked the debut of Ajay Devgn, son of stunt and action choreographer Veeru Devgan, and Madhoo, niece of actress Hema Malini. The film won Ajay Devgn, the Filmfare Award for Best Male Debut for 1991.  Phool Aur Kaante was a Super Hit at the box office in India, and was noted for its soundtrack. the movie is loosey based on a Malayalam film Parampara (1990) starting Mammootty and Suresh Gopi. Phool Aur Kaante clashed with Yash Chopra directed Lamhe at the box office. However Phool Aur Kante proved to be a super hit, on the other hand Lamhe which starred Anil Kapoor bombed at the box office.  Ajay Devgan's entry in the film became very popular where he appeared standing, balancing on two moving motorcycles. Similar stunts have been repeated in a number of films since."
    },
    {
      "id": 7,
      "genre": "action",
      "imdb_id": "tt1355546",
      "title": "Ayan",
      "plot": "Deva (Surya Sivakumar) arrives at the Chennai International Airport after running an errand for Arumuga Dass (Prabhu Ganesan) of smuggling pre-release pirated movies on DVD. The two leave for their hideout and instruct Dilli (Karunas), a hearing-impaired assistant of Dass, to make copies of the DVD. Just when police crews arrive into their vicinity, Dass informs Deva and the rest to leave. Deva tells the others to leave while he quickly sets up the burning process. Deva also leaves the hideout just in time. However, the police officers arrive at the hideout, only to see the burning process of the DVDs complete. The police then seize the DVDs and computers. The inspector, who was a friend of Dass, tells him that he can close the case if one of Dass's men agrees to the crime. Deva attempts to go, but another man, Chitti (Jegan), who had no affiliation to them volunteers, takes the blame. Later, Chitti joins Dass's group."
    },
    {
      "id": 8,
      "genre": "action",
      "imdb_id": "tt0358148",
      "title": "Shut Up and Kiss Me!",
      "plot": "Ryan and Pete are 27-year old best friends in Miami, born on the same day and each searching for the perfect woman. Ryan is a rookie stockbroker living with his psychic Mom. Pete is a slick surfer dude yet to find commitment. Each meets the women of their dreams on the same day. Ryan knocks heads in an elevator with the gorgeous Jessica, passing out before getting her number. Pete falls for the insatiable Tiara, but Tiara's uncle is mob boss Vincent Bublione, charged with her protection. This high-energy romantic comedy asks to what extent will you go for true love?"
    },
    {
      "id": 9,
      "genre": "action",
      "imdb_id": "tt0049287",
      "title": "Gunslinger",
      "plot": "After her husband is gunned down, Rose Hood takes his place as sheriff of a small Western town."
    },
    {
      "id": 10,
      "genre": "action",
      "imdb_id": "tt0034889",
      "title": "In Old California",
      "plot": "Boston pharmacist Tom Craig comes to Sacramento, where he runs afoul of local political boss Britt Dawson, who exacts protection payment from the citizenry. Dawson frames Craig with poisoned medicine, but Craig redeems himself during a Gold Rush epidemic."
    },
    {
      "id": 11,
      "genre": "action",
      "imdb_id": "tt0040082",
      "title": "Albuquerque",
      "plot": "Cole Armin comes to Albuquerque to work for his uncle, John Armin, a despotic and hard-hearted czar who operates an ore-hauling freight line, and whose goal is to eliminate a competing line run by Ted Wallace and his sister Celia. Cole tires of his uncle's heavy-handed tactics and switches over to the Wallace side. Lety Tyler, an agent hired by the uncle, also switches over by warning Cole and Ted of a trap set for them by the uncle and his henchman."
    },
    {
      "id": 12,
      "genre": "action",
      "imdb_id": "tt0045077",
      "title": "The Redhead from Wyoming",
      "plot": "In Wyoming Territory, a range war is brewing between entrenched cattle barons and new settlers. Cattle king Reece Duncan is opposed by ambitious gambler Jim Averell..."
    },
    {
      "id": 13,
      "genre": "action",
      "imdb_id": "tt0477337",
      "title": "Mechenosets",
      "plot": "a"
    },
    {
      "id": 14,
      "genre": "action",
      "imdb_id": "tt0021345",
      "title": "The Sea Bat",
      "plot": "The sister (Raquel Torres) of a sponge diver killed by a stingray loves an escaped convict (Charles Bickford) posing as a priest."
    },
    {
      "id": 15,
      "genre": "action",
      "imdb_id": "tt0119239",
      "title": "Gupt: The Hidden Truth",
      "plot": "When Governor Jaisingh Sinha is murdered, the needle of suspicion points towards his estranged son Sahil who has been fighting with his father over the girl he had chosen for him to marry. Sahil is in love with Isha but the governor wanted him to marry Sheetal. Now Sahil must prove his innocence and find out who the killer is."
    },
    {
      "id": 16,
      "genre": "action",
      "imdb_id": "tt0920457",
      "title": "Billa",
      "plot": "The intertwined stories of an international Don in Malaysia, David Billa, chased by the cops, an Indian police officer, a woman who wants to avenge the death of her brother, and a lowly thief, Velu who shares with Billa, an unusual connection."
    },
    {
      "id": 17,
      "genre": "action",
      "imdb_id": "tt4864932",
      "title": "Baaghi",
      "plot": "Baaghi is the story of Ronny, a rebellious 23-year-old from Delhi. Fearing his unruly and angry temperament his father sends him to a disciplinary academy set in a sleepy town in Kerala. While traveling to the academy he meets Siya who also carries a rebellious streak but nonetheless spark fly between them. After his enrollment, Ronny encounters the star student Raghav and things get awry between them when Raghav falls for Siya as well. Years later Ronny is informed that Siya is abducted and is called upon for help to rescue her from the gritty underbelly of Thailand. Lost in the midst of a new city Ronny comes face to face with his nemesis, Raghav. They both still love Siya unconditionally and are in a battle to win her heart. But there will be only one person who will. Who will it be the rebellious Ronny or the furious Raghav?"
    },
    {
      "id": 18,
      "genre": "action",
      "imdb_id": "tt0106922",
      "title": "Fit to Kill",
      "plot": "Buxom do-gooders Donna and Nicole set out to reclaim the stolen Alexa diamond from its hiding place in Russia … only to run into their nemesis, Martin Kane."
    },
    {
      "id": 19,
      "genre": "action",
      "imdb_id": "tt1079360",
      "title": "The Girl from the Naked Eye",
      "plot": "Jake is a driver for a seedy escort service operating out of 'The Naked Eye strip club', he's a street thug type who falls for a witty high-class escort named Sandy. Except one night Sandy is found murdered, the only clues left behind are cell phone calls made the night she died. To avenge Sandy's death Jake must risk everything and walk a bloody path to find her killer."
    },
    {
      "id": 20,
      "genre": "action",
      "imdb_id": "tt0477327",
      "title": "Butterfly Kiss",
      "plot": "Potseluy babochki (Russian: Поцелуй бабочки, meaning Butterfly Kiss) is a 2006 Russian film directed by Anton Sivers. The world premiere of the film was held July 21, 2006. He (Nikolai Orlanov) is the genius of industrial espionage. She (Li) is a Chinese. She has nothing, she does not even have a name. They love each other madly, but they belong to the system. Go away from the system can only be to the madhouse, or to the grave."
    },
    {
      "id": 21,
      "genre": "action",
      "imdb_id": "tt2015315",
      "title": "Hindsight",
      "plot": "Retired mob boss Du-heon enrolls in a cooking class with the hopes of making a fresh start as a restaurant owner. In the class he meets a quirky girl, Se-bin, and finds himself drawn to her. Despite his determination to wipe the slate clean, Du-heon is summoned back into the criminal fold by his old colleagues."
    },
    {
      "id": 22,
      "genre": "action",
      "imdb_id": "tt0827714",
      "title": "Jaane Hoga Kya",
      "plot": "A doctor obsessed with new technology and science, decides to clone himself when he comes in contact with a sponsor."
    },
    {
      "id": 23,
      "genre": "action",
      "imdb_id": "tt0026047",
      "title": "Air Hawks",
      "plot": "An air delivery service is menaced by a mad scientist with a death ray machine that blows up planes in mid-flight."
    },
    {
      "id": 24,
      "genre": "action",
      "imdb_id": "tt2246837",
      "title": "Maattrraan",
      "plot": "Akilan and Vimalan are the conjoined twins of genetic scientist Ramachandran, whose company makes Energion, a dietary supplement that promises to make geniuses out of children. When Russian journalist Volga tells them that there is something fishy about Energion and is mysteriously found dead, their lives are turned topsy-turvy."
    },
    {
      "id": 25,
      "genre": "action",
      "imdb_id": "tt0222299",
      "title": "Princess",
      "plot": "Princess is the title of a photo novel which will be written by Walter and photographed by Mark. A story of sex and violence which has great success. But Mark falls so much in love with his model that he can't tell her apart from Princess..."
    },
    {
      "id": 26,
      "genre": "action",
      "imdb_id": "tt0039243",
      "title": "Captain from Castile",
      "plot": "Spain, 1518: young caballero Pedro De Vargas offends his sadistic neighbor De Silva, who just happens to be an officer of the Inquisition. Forced to flee, Pedro, friend Juan Garcia, and adoring servant girl Catana join Cortez' first expedition to Mexico. Arriving in the rich new land, Cortez decides to switch from exploration to conquest...with only 500 men. Embroiled in continuous adventures and a romantic interlude, Pedro almost forgets he has a deadly enemy..."
    },
    {
      "id": 27,
      "genre": "action",
      "imdb_id": "tt0377321",
      "title": "Aasai",
      "plot": "The story goes around Suvalakshmi, who is one of the two daughters of an orthodox family. The film starts off when Yamuna (Suvalakshmi) comes to Madras for her studies. Major Madhavan (Prakashraj) is the husband of Yamuna's elder sister, and it was love at first sight for him. Meanwhile, Yamuna falls in love with Jeeva (Ajithkumar), a handsome young man who too loves her. Then there is a scene which shows Madhavan telling his love that he has on Yamuna to his wife."
    },
    {
      "id": 28,
      "genre": "action",
      "imdb_id": "tt0028401",
      "title": "The Trail of the Lonesome Pine",
      "plot": "A well-established tale of a long-running feud between two mountain clans. The features of this production were the new three-strip Technicolor process showing the outdoor Californian settings and an energetic young cast. It is said that Li'l Abner was based on Henry Fonda's performance."
    },
    {
      "id": 29,
      "genre": "action",
      "imdb_id": "tt0026097",
      "title": "Barbary Coast",
      "plot": "Mary Rutledge arrives from the east, finds her fiance dead, and goes to work at the roulette wheel of Louis Charnalis' Bella Donna, a rowdy gambling house in San Francisco in the 1850s. She falls in love with miner Carmichael and takes his gold dust at the wheel. She goes after him, Louis goes after her with intent to harm Carmichael."
    },
    {
      "id": 30,
      "genre": "action",
      "imdb_id": "tt0211174",
      "title": "Up, Up, and Away",
      "plot": "A boy is the only family member without superpowers in this Disney Film. The world depends on him saving his family from computerized brainwashers. Will he realize that it doesn't take superpowers to be a hero in time to help them defeat the villains?"
    },
    {
      "id": 31,
      "genre": "action",
      "imdb_id": "tt0272790",
      "title": "Princess of Thieves",
      "plot": "Sherwood forest has a courageous new hero - Gwyn, the daughter of Robin Hood. Possessing the cunning skills of her legendary father and the beauty and intelligence of her mother Maid Marian, Gwyn is anxious to follow in her father's footsteps. King Richard nears death and Robin Hood and his Merry Men are summoned to help bring Richard's son Philip to his rightful place on the throne before the evil Prince John can assume power. Robin Hood's life and that of the future King of England soon lies in Gwyn's hands when Robin is captured and sentenced to death."
    },
    {
      "id": 32,
      "genre": "action",
      "imdb_id": "tt0041238",
      "title": "Challenge to Lassie",
      "plot": "When Lassie's master dies, an old friend tries to convince a judge that the dog's life should be spared."
    },
    {
      "id": 33,
      "genre": "action",
      "imdb_id": "tt0466449",
      "title": "Island of Lost Souls",
      "plot": "14-year-old Lulu moves to a small provincial town with her mother and younger brother. One night, her brother is struck by a beam of white light - actually the spirit of Herman Hartmann from the 19th-century. To her despair, Lulu realizes that Herman has possessed her brother, and the two of them are whirled into a fevered adventure."
    },
    {
      "id": 34,
      "genre": "action",
      "imdb_id": "tt0108559",
      "title": "White Wolves - A Cry in the Wild II",
      "plot": "A two-week trek through the Cascade Mountains tries the survival instincts of five adventurous teenagers. At first, it's all a good time. Shooting the rapids, exploring caves and making new friends. But when an accident occurs, Mother Nature raises the stakes and challenges the hikers to the greatest test of their young lives. Written by Concorde - New Horizons (with permission)."
    },
    {
      "id": 35,
      "genre": "action",
      "imdb_id": "tt0090729",
      "title": "Biggles",
      "plot": "Unassuming catering salesmen Jim Ferguson falls through a time hole to 1917 where he saves the life of dashing Royal Flying Corps pilot James \"Biggles\" Bigglesworth after his photo recon mission is shot down. Before he can work out what has happened, Jim is zapped back to the 1980s......"
    },
    {
      "id": 36,
      "genre": "action",
      "imdb_id": "tt1351685",
      "title": "Jack the Giant Slayer",
      "plot": "The story of an ancient war that is reignited when a young farmhand unwittingly opens a gateway between our world and a fearsome race of giants. Unleashed on the Earth for the first time in centuries, the giants strive to reclaim the land they once lost, forcing the young man, Jack into the battle of his life to stop them. Fighting for a kingdom, its people, and the love of a brave princess, he comes face to face with the unstoppable warriors he thought only existed in legend–and gets the chance to become a legend himself."
    },
    {
      "id": 37,
      "genre": "action",
      "imdb_id": "tt0387658",
      "title": "Bionicle 2: Legends of Metru Nui",
      "plot": "The legends tells the story of how the Toa came to be, chosen from the pool of Matoran youth in the great city of Metru Nui and, though physically transformed, hardly prepared for increased size and super heroic powers. Now in short order, the Toa--who babble and bicker like agitated adolescents--have to master their new gifts, impress their leader, and prepare to protect their home."
    },
    {
      "id": 38,
      "genre": "action",
      "imdb_id": "tt0107482",
      "title": "Magic Kid",
      "plot": "Karate action and laughs never cease when a brother and sister go to California to visit their uncle. They soon discover that he's an alcoholic on the run from the Mob who want him to pay up or else..."
    },
    {
      "id": 39,
      "genre": "action",
      "imdb_id": "tt1851988",
      "title": "Ko",
      "plot": "The movie opens with a scene of a bank robbery in progress. The actions of the robbers during the gateway is photographed by Ashwin (Jeeva). After a chase, the injured Ashwin loses his camera to the robbers but managed to retrieve the memory card. His brave actions are broadcasted in the local TV channels and earns him praises from his colleagues and media friends."
    },
    {
      "id": 40,
      "genre": "action",
      "imdb_id": "tt0092532",
      "title": "Alien from L.A.",
      "plot": "When her archaeologist father disappears on an expedition, Wanda sets out to look for him. What she finds is a secret underground world, where no one believes in life on the surface and where she and her father are taken for spies."
    },
    {
      "id": 41,
      "genre": "action",
      "imdb_id": "tt0811080",
      "title": "Speed Racer",
      "plot": "Speed Racer is the tale of a young and brilliant racing driver. When corruption in the racing leagues costs his brother his life, he must team up with the police and the mysterious Racer X to bring an end to the corruption and criminal activities. Inspired by the cartoon series."
    },
    {
      "id": 42,
      "genre": "action",
      "imdb_id": "tt0107838",
      "title": "Pocket Ninjas",
      "plot": "Somewhere in New Jersey, a group masked rollerblading children \"save the universe\" by training to fight the evil Cobra Khan through a series of action-packed montages.  Along the way they hypothesize some slapstick hijinks in a balloon factory, and save the day through a hypothetical Sonic Virtual Reality battle.  A real treat!"
    },
    {
      "id": 43,
      "genre": "action",
      "imdb_id": "tt0047189",
      "title": "Long John Silver",
      "plot": "In this sequel to Treasure Island, Long John hopes to rescue his friend Jim from a rival pirate and return for more treasure."
    },
    {
      "id": 44,
      "genre": "action",
      "imdb_id": "tt5178278",
      "title": "Vedhalam",
      "plot": "Ganesh, a cab driver and a doting brother to his sister Tamizh, is hunting down three notorious criminals in Kolkata. Who is he actually and what's his motive?"
    },
    {
      "id": 45,
      "genre": "action",
      "imdb_id": "tt0296712",
      "title": "Catch That Girl",
      "plot": "Ida's father suddenly gets a stroke and is rushed to the hospital, diagnosed with a deadly disease with no other opportunity than to travel to USA to attend a medical experimental operation. Unfortunately, the small family have to get the money themselves, as the state doesn't pay for that kind of experimental procedures. Ida has to get the money - and she got no other way than to steal them from the bank where her mother works...... developing the banks intense security."
    },
    {
      "id": 46,
      "genre": "action",
      "imdb_id": "tt0116341",
      "title": "Forest Warrior",
      "plot": "John McKenna is a spiritual being who is able to transform into bear, wolf or eagle. He lives in the forests of Tanglewood and has dedicated his life to protect them. One day a gang of evil lumberjacks led by Travis Thorne arrive Tanglewood to chop the forest down. McKenna cannot let this happen, and together with his new friends - Lords of the Tanglewood, a band of children who love to play in the forest - he battles against Thorne and his evil gang."
    },
    {
      "id": 47,
      "genre": "action",
      "imdb_id": "tt0016013",
      "title": "Lazybones",
      "plot": "Steve Tuttle, the titular lazybones, takes on the responsibility of raising a fatherless girl, causing a scandal in his small town. Many years later, having returned from World War I, he discovers that he loves the grown-up girl."
    },
    {
      "id": 48,
      "genre": "action",
      "imdb_id": "tt0223958",
      "title": "The Surrender of Tournavos",
      "plot": "Three military men, seen inside a fortification, are firing on an unseen enemy force. The call for reinforcements but ladders appear signalling the enemy is about to overrun this position."
    },
    {
      "id": 49,
      "genre": "action",
      "imdb_id": "tt2992552",
      "title": "Seal Team Eight: Behind Enemy Lines",
      "plot": "Seal Team Eight must fight their way deep into Africa's Congo, decommission a secret uranium mine, and stop our most dangerous enemy from smuggling weapon's grade yellow-cake out of the country."
    },
    {
      "id": 50,
      "genre": "action",
      "imdb_id": "tt0053183",
      "title": "Pork Chop Hill",
      "plot": "American GI's must retake a barren hill in Korea that has been overrun by Red Chinese troops. The ensuing battle becomes a meat grinder for American and Chinese alike."
    },
    {
      "id": 51,
      "genre": "action",
      "imdb_id": "tt0035957",
      "title": "Guadalcanal Diary",
      "plot": "Concentrating on the personal lives of those involved, a war correspondent takes us through the preparations, landing and initial campaign on Guadalcanal during WWII."
    },
    {
      "id": 52,
      "genre": "action",
      "imdb_id": "tt0035153",
      "title": "One of Our Aircraft Is Missing",
      "plot": "During the Allied Bombing offensive of World War II the public was often informed that \"A raid took place last night over ..., One (or often more) of Our Aircraft Is Missing\". Behind these sombre words hid tales of death, destruction and derring-do. This is the story of one such bomber crew who were shot down and the brave Dutch patriots who helped them home."
    },
    {
      "id": 53,
      "genre": "action",
      "imdb_id": "tt0057864",
      "title": "Back Door to Hell",
      "plot": "During WWII, a three-man commando team places its trust in the hands of a band of Filipino resistors, as they try to knock out a Japenese communication center."
    },
    {
      "id": 54,
      "genre": "action",
      "imdb_id": "tt0020815",
      "title": "The Dawn Patrol",
      "plot": "World War I ace Dick Courtney derides the leadership of his superior officer, but Courtney is soon promoted to squadron commander and learns harsh lessons about sending subordinates to their deaths."
    },
    {
      "id": 55,
      "genre": "action",
      "imdb_id": "tt2157346",
      "title": "Rommel",
      "plot": "A new film about Erwin Rommel has been shown on German television, depicting the general as a weak man undone by his links to Adolf Hitler."
    },
    {
      "id": 56,
      "genre": "action",
      "imdb_id": "tt5050200",
      "title": "Beyond Valkyrie: Dawn of the Fourth Reich",
      "plot": "An intense thriller from the frontlines of World War II. As Operation Valkyrie prepares to assassinate Adolph Hitler, an Allied special ops team prepares to extract the man destined to lead post-war Germany. But after Valkyrie fails, everything changes. Now, unlikely allies must work together to stop a group of Nazi Officers from fleeing to Argentina and establishing the Fourth Reich."
    },
    {
      "id": 57,
      "genre": "action",
      "imdb_id": "tt0051349",
      "title": "Ambush at Cimarron Pass",
      "plot": "A small Army patrol unit and a couple of former Confederates reluctantly throw in their lot together after being attacked by a band of Native Americans."
    },
    {
      "id": 58,
      "genre": "action",
      "imdb_id": "tt0060095",
      "title": "Alvarez Kelly",
      "plot": "A suave Mexican cattleman inadvertently gets involved in the Civil War."
    },
    {
      "id": 59,
      "genre": "action",
      "imdb_id": "tt0050762",
      "title": "Nine Lives",
      "plot": "The movie takes place during World War II and depicts the true story of Jan Baalsruds amazing escape from the German army from the coast of Northern Norway and across the border to the neutral country Sweden."
    },
    {
      "id": 60,
      "genre": "action",
      "imdb_id": "tt0120157",
      "title": "Soldier",
      "plot": "Sergeant Todd is a veteran soldier for an elite group of the armed forces. After being defeated by a new breed of genetically engineered soldiers, he is dumped on a waste planet and left for dead. He soon interacts with a group of crash survivors who lead out a peaceful existence. The peace is broken as the new soldiers land on the planet to eliminate the colony, which Sergeant Todd must defend."
    },
    {
      "id": 61,
      "genre": "action",
      "imdb_id": "tt0062688",
      "title": "Attack on the Iron Coast",
      "plot": "Attack on the Iron Coast is a 1967 British-American Oakmont Productions international co-production war film directed by Paul Wendkos in the first of his five picture contract with Mirisch Productions, and starring Lloyd Bridges, Andrew Keir, Sue Lloyd, Mark Eden and Maurice Denham. The film depicts an account of Allied Combined Operations Headquarters commandos executing a daring raid on the German-occupied French coast during the Second World War. The film is based on the commando raid on the French port of St. Nazaire and is reminiscent of the film The Gift Horse. In the United States it was released as a double feature with Danger Route."
    },
    {
      "id": 62,
      "genre": "action",
      "imdb_id": "tt0089436",
      "title": "Commando Leopard",
      "plot": "A cruel dictator rules a Latin American state. Corruption, brutality and exploitation are present every day. A few people begin to organise resistance. Under the leader \"El Leopardo\" a small group of guerillas fights against the violent government."
    },
    {
      "id": 63,
      "genre": "action",
      "imdb_id": "tt0094899",
      "title": "The Commander",
      "plot": "Lewis Collins is back to leading mercenaries on the move in Southeast Asia. This time the cast is unusually good including Lee Van Cleef, Brett Halsey (Cop Game), Romano Puppo (Robowar), Mike Monty (Raiders of Atlantis), Bobby Rhodes (The Great Alligator), etc. Anyway, Van Cleef has Collins go on some random mission to locate a disc with all sorts of valuable crazy intelligence data on it. It just happens that Donald Pleasence, a random government official, hires another mercenary-for-hire Manfred Lehman to tag along and make sure the data ends up in the right hands. Van Cleef isn't taking any chances, and since he is crooked and murders Collins's other bosses quickly, he places Romano Puppo in the group as well to make sure the operation runs smoothly. Collins may not be too expressive but at least he seems to figure out quickly who's out to get him, so the mission continues with lots of double-crosses, twists and turns, and of course lots of explosions!"
    },
    {
      "id": 64,
      "genre": "action",
      "imdb_id": "tt0036824",
      "title": "The Fighting Seabees",
      "plot": "Construction workers in World War II in the Pacific are needed to build military sites, but the work is dangerous and they doubt the ability of the Navy to protect them. After a series of attacks by the Japanese, something new is tried, Construction Battalions (CBs=Seabees). The new CBs have to both build and be ready to fight."
    },
    {
      "id": 65,
      "genre": "action",
      "imdb_id": "tt0094792",
      "title": "Braddock: Missing in Action III",
      "plot": "When Colonel James Braddock is told that his Asian wife and 12-year-old son are still alive in Communist Vietnam, he mounts a one-man assault to free them. Armed with the latest high-tech firepower, Braddock fights his way into the heart of the country and ends up battling his way out with several dozen abused Amerasian children in tow! Struggling to keep them alive while outmaneuvering a sadistic Vietnamese officer, Braddock ignites the jungle in a blazing cross-country race for freedom."
    },
    {
      "id": 66,
      "genre": "action",
      "imdb_id": "tt3204734",
      "title": "Allies",
      "plot": "August 1944 two months after D-Day, the Allies are advancing across France. A team of British and American commandos are dropped behind enemy lines on a secret mission to ambush a German Officer and steal maps charting the location of the enemy artillery along the front line."
    },
    {
      "id": 67,
      "genre": "action",
      "imdb_id": "tt2032572",
      "title": "USS Indianapolis: Men of Courage",
      "plot": "The harrowing true story of the crew of the USS Indianapolis, who were stranded in the Philippine Sea for five days after delivering the atomic weapons that would eventually end WWII. As they awaited rescue, they endured extreme thirst, hunger, and relentless shark attacks."
    },
    {
      "id": 68,
      "genre": "action",
      "imdb_id": "tt0089026",
      "title": "The Dirty Dozen: Next Mission",
      "plot": "Major Reisman is \"volunteered\" to lead another mission using convicted army soldiers, sentenced to either death or long prison terms. This time their mission is to kill a Nazi general who plans to assassinate Hitler."
    },
    {
      "id": 69,
      "genre": "action",
      "imdb_id": "tt5344794",
      "title": "Sniper: Special Ops",
      "plot": "A Special Ops military Force, led by expert sniper Sergeant Jake Chandler, are sent to a remote Afghan village to extract an American congressman being held by the Taliban."
    },
    {
      "id": 70,
      "genre": "action",
      "imdb_id": "tt0061389",
      "title": "Beach Red",
      "plot": "American troops storm ashore on a Japanese-held island and push inland while their enemies plan a counterattack in this look at warfare. Soldiers on both sides are haunted by memories of home and the horrifying, sickening images they find in combat."
    },
    {
      "id": 71,
      "genre": "action",
      "imdb_id": "tt0066064",
      "title": "The McKenzie Break",
      "plot": "A German U-Boat commander and 600 prisoners plan a daring escape from a PoW camp in Scotland."
    },
    {
      "id": 72,
      "genre": "action",
      "imdb_id": "tt0025423",
      "title": "The Lost Patrol",
      "plot": "A World War I British Army patrol is crossing the Mesopotamian desert when their commanding officer, the only one who knows their destination is killed by the bullet of unseen bandits. The patrol's sergeant keeps them heading north on the assumption that they will hit their brigade. They stop for the night at an oasis and awake the next morning to find their horses stolen, their sentry dead, the oasis surrounded and survival difficult."
    },
    {
      "id": 73,
      "genre": "action",
      "imdb_id": "tt1253863",
      "title": "300: Rise of an Empire",
      "plot": "Based on Frank Miller's latest graphic novel Xerxes and told in the breathtaking visual style of the blockbuster \"300,\" this new chapter of the epic saga takes the action to a fresh battlefield--on the sea--as Greek general Themistokles attempts to unite all of Greece by leading the charge that will change the course of the war. \"300: Rise of an Empire\" pits Themistokles against the massive invading Persian forces led by mortal-turned-god Xerxes and Artemesia, the vengeful commander of the Persian navy."
    },
    {
      "id": 74,
      "genre": "action",
      "imdb_id": "tt0063655",
      "title": "Submarine X-1",
      "plot": "After losing a submarine and fifty crew in a battle with a German ship during WWII, a Royal Navy officer gets a second chance in a daring raid with midget subs."
    },
    {
      "id": 75,
      "genre": "action",
      "imdb_id": "tt0075019",
      "title": "Operation: Daybreak",
      "plot": "Czechoslovakia, 1942. Three brave Czech patriots risk everything to rid their country of its brutal Nazi leader, SS-General Reinhard Heydrich."
    },
    {
      "id": 76,
      "genre": "action",
      "imdb_id": "tt1558575",
      "title": "Fortress",
      "plot": "When the commander of the crew of a B-17 Flying Fortress bomber is killed in action in a raid over Sicily in 1943, his replacement, a young, naive pilot struggles to be accepted by the plane's already tight-knit Irish American crew."
    },
    {
      "id": 77,
      "genre": "action",
      "imdb_id": "tt0094059",
      "title": "Strike Commando",
      "plot": "While operating behind enemy lines, Sgt. Mike Ransom learns of a Russian presence in North Vietnam. Ordered to obtain proof of this discovery, Ransom returns to enemy territory but is captured and subjected to a variety of tortures. Eventually he escapes to continue his mission despite being hampered by a traitor in his own ranks."
    },
    {
      "id": 78,
      "genre": "action",
      "imdb_id": "tt0072913",
      "title": "Master of the Flying Guillotine",
      "plot": "A one-armed martial arts master is being stalked by an Imperial assassin, the master of two fighters (the Tibetan Lamas) who were killed in the previous film. When the One-Armed Boxer is invited to attend a martial arts tournament, his efforts to lay low are unsuccessful, and the assassin soon tracks him down with the help of his three subordinates competing in the tournament: a Thai boxer, a yoga master, and a kobojutsu user."
    },
    {
      "id": 79,
      "genre": "action",
      "imdb_id": "tt0224098",
      "title": "Ninja 4: Siege",
      "plot": "[Period covered: 1614-1615] 4th film in the shinobi no mono series  Tokugawa Ieyasu is now the ruler of all Japan. But one last loose thread must be tied up before his domination is complete -- the destruction of the Toyotomi clan, now beseiged in Osaka castle. Ieyasu's ninja are the only ones who can penetrate the fortress, but unfortunately for Ieyasu, Kirigakure Saizo (Ichikawa) and the other Toyotomi ninja can just as easily get out. As armies of samurai maneuver for battle, the fate of the nation will be decided by a desperate struggle in the dark!"
    },
    {
      "id": 80,
      "genre": "action",
      "imdb_id": "tt2828840",
      "title": "Fists of Legend",
      "plot": "On a television show billed as “the greatest fight show on Earth,” eager amateurs with lots to prove boldly step into the ring and expect to leave bloody but victorious. The ratings hungry producers seek out “legendary” but largely forgotten streetfighters and mine their desperation for recaptured glory and redemption into ratings gold."
    },
    {
      "id": 81,
      "genre": "action",
      "imdb_id": "tt0398563",
      "title": "Sky High",
      "plot": "A serial-murderer is on the loose who just so happens to also be removing the hearts of his victims and taking them with him. His victims however, are not merely random humans as thought by the police. They are in fact, the past and present guardians of the gateway of the afterlife.On the day he is to be married, Detective Kanzaki, who happens to be on the case, discovers that his fiancé Mina has been murdered with her heart also missing. He also learns that the killers are Kudo, a geneticist, and his evil secretary Rei. The two are trying to obtain six hearts from the guardians so that they may call forth a horde of demons from the Gate of Rage and have their every desire granted. Only problem is, once they open the gate the entire world will be covered in darkness."
    },
    {
      "id": 82,
      "genre": "action",
      "imdb_id": "tt0314111",
      "title": "Godzilla Against MechaGodzilla",
      "plot": "After the appearance of a new Gojira (Godzilla), the Japanese government builds a robotic Godzilla from the bones of the original monster that attacked Tokyo in 1954 to stop the beast."
    },
    {
      "id": 83,
      "genre": "action",
      "imdb_id": "tt0085951",
      "title": "The Boxer's Omen",
      "plot": "After suffering an injury in the ring, embattled boxer Zhen Wei enlists the aid of his brother, Zhen Xiong, to avenge him and find the key to an omen which may release their family from an ancient curse. Black wizards, Taoist monks, rampaging monsters, spooky apparitions, beastly crocodile skeletons, flying human heads, a sexy female zombie with long talons, and demonic bats lie in store for our hero."
    },
    {
      "id": 84,
      "genre": "action",
      "imdb_id": "tt0118751",
      "title": "Border",
      "plot": "The year is 1971 when the Pakistani Army is at war with the Indian Soldiers. The Indian battalion is posted in Longewala region in Punjab and are just 150 in number while the Pakistani Army consists of 2000 armed soldiers with tanks."
    },
    {
      "id": 85,
      "genre": "action",
      "imdb_id": "tt0064916",
      "title": "Sabata",
      "plot": "Several pillars of society have robbed an Army safe containing $100,000 so they can buy the land upon which the coming railroad will be built. But they haven't reckoned on the presence of the master gunslinger, Sabata."
    },
    {
      "id": 86,
      "genre": "action",
      "imdb_id": "tt0963915",
      "title": "Dynamite Warrior",
      "plot": "The story is set in 1890s Siam. Siang is a young Muay Thai warrior and rocketry expert who steals back water buffalo taken from poor Isan farmers by unscrupulous cattle raiders. He is searching for a man with a tattoo who killed his parents."
    },
    {
      "id": 87,
      "genre": "action",
      "imdb_id": "tt1060249",
      "title": "Drona",
      "plot": "a"
    },
    {
      "id": 88,
      "genre": "action",
      "imdb_id": "tt0415908",
      "title": "Kaal",
      "plot": "Kaal is based around the story of a wildlife expert, his wife and a group of friends who battle against supernatural creatures in the Jim Corbett National Park for their lives."
    },
    {
      "id": 89,
      "genre": "action",
      "imdb_id": "tt0816258",
      "title": "Pokiri",
      "plot": "Pandu (Mahesh Babu) is a ruthless mafia man who kills anybody for money. He falls in love with Sruthi (Ileana) at the very first sight. Sruthi too loves Pandu, but hesitates to confess her love to him as he is a reckless criminal. Though a goon, Pandu has certain rigid principles that leads for an enmity with Ali (Prakash Raj) - the biggest mafia don in the town. The rest of the story is all about how he settles score with Ali."
    },
    {
      "id": 90,
      "genre": "action",
      "imdb_id": "tt0475750",
      "title": "Typhoon",
      "plot": "Myung-sin, who has become a pirate, lives with hatred in his heart and endures the hardships, seeks revenge on the two nations, North and South Korea, using nuclear waste that has the devastating power of plutonium. Se-jong, a South Korean naval officer departs with his team of elite forces to prevent Sin's master plan of Nuclear Typhoon. Born under the same skies of the same race, but of a completely different nation... Living a life so different, the two point their guns at each other's heart..."
    },
    {
      "id": 91,
      "genre": "action",
      "imdb_id": "tt0477857",
      "title": "Sehar",
      "plot": "Ajay Kumar (Warsi) is the newly appointed, honest SSP of Lucknow police. Of his family only his mother (Mulay) remains, and she inspires and motivates him to do the right thing. Ajay tries to crack down on the UP mafia, but more often than not is betrayed by information-leaking local police officials. His boss tries to aid him by shielding him from political pressures, and by getting sanction for"
    },
    {
      "id": 92,
      "genre": "action",
      "imdb_id": "tt0266408",
      "title": "China Strike Force",
      "plot": "A young Chinese Security Officer, Darren, is called for Team 808, which fights against the smuggling of drugs and corruption. Noriko, a Japanese Interpol officer, collaborates with Darren for the destruction of a large international drug cartel. At the same time, a senior government officer's daughter is suspected of corruption."
    },
    {
      "id": 93,
      "genre": "action",
      "imdb_id": "tt0471571",
      "title": "Athadu",
      "plot": "Athadu is a Action Movie Directed by Trivikram Srinivas Rao.Nandu (Mahesh Babu), an orphan, is a top-notch professional killer in town. He maneuvers his operations with the help of his buddy (Sonu Sood). In one such operation, he falls into the eyes of the cops. While fleeing from the crime scene, he unintentionally becomes the cause for the death of a stranger called Pardhoo (Rajiv Kanakala), a run-away youngster who wants to return home after 12 years. Nandu assumes the identity of Pardhoo and enters his household in a remote village to escape from the cops. The rest of the story is all about how Nandu solves all the problems."
    },
    {
      "id": 94,
      "genre": "action",
      "imdb_id": "tt0901488",
      "title": "Eye in the Sky",
      "plot": "The head of an elite Hong Kong surveillance unit (Simon Yam) keeps one eye on his rookie apprentice (Kate Tsui) and the other on a notorious criminal (Tony Leung Ka Fai) he suspects of masterminding a recent jewel heist in this tense thriller from filmmaking duo Johnnie To and Nai-Hoi Yau. Of course, the criminal knows all along he's being watched. But that doesn't stop him from trying to pull off the biggest score of his career."
    },
    {
      "id": 95,
      "genre": "action",
      "imdb_id": "tt0074747",
      "title": "The Killer Meteors",
      "plot": "Mi Wey is a local hero named after \"Killer Meteors\", his secret weapon which makes him invincible. However, when \"Immortal\" Wa Wu Bin, another powerful local character seeks his assistance, Killer Meteor will face the greatest and the deadliest challenge of his life."
    },
    {
      "id": 96,
      "genre": "action",
      "imdb_id": "tt0110438",
      "title": "Main Khiladi Tu Anari",
      "plot": "A Bombay police officer seeks revenge when his brother is killed by a powerful underworld figure. Things get complicated when a matinee movie idol begins to tag along the policeman so he can research a movie role."
    },
    {
      "id": 97,
      "genre": "action",
      "imdb_id": "tt0216750",
      "title": "Total Western",
      "plot": "Un flingueur abruti, un deal mal negocie, pas mal de morts et quelques millions de francs poussent Gerard Bedecarrax, dit Bede, a se mettre au vert. Direction Millau dans l'Aveyron, ou s'erige l'Esperance, centre d'hebergement pour jeunes delinquants. La, tout irait pour le mieux dans le meilleur des mondes si Ludo Daes, accompagne de cerberes armes jusqu'aux dents, ne tenait a tout prix a recuperer son argent."
    },
    {
      "id": 98,
      "genre": "action",
      "imdb_id": "tt0076939",
      "title": "The Invincible Armour",
      "plot": "Hwang Jang Lee is a corrupt Ming guard who frames John Liu for murder. A wanted fugitive, John hides out with a teen who is an expert in the infamous Iron Armor technique, a technique that means the expert can withstand anything. However, Hwang is an expert in it as well as the Eagle Claw's. Can John stop Hwang befgore it's too late?"
    },
    {
      "id": 99,
      "genre": "action",
      "imdb_id": "tt0223783",
      "title": "Stray Cat Rock: Sex Hunter",
      "plot": "Mako and her girl friends enter a dispute with rival street gangsters The Eagles, a band of racist macho pigs led by the evil Baron, who hate half-breeds (descendents of afro-American and Japanese couples). When one of the girls start dating a half-breed, they start a terror campaign to take all of them out of town. Mako and her gang fight back, helping their new friend Kazuma find his long gone sister."
    },
    {
      "id": 100,
      "genre": "action",
      "imdb_id": "tt0091428",
      "title": "Legacy of Rage",
      "plot": "Brandon plays Brandon Ma, a regular working Joe who holds down two jobs, so he can support his girlfriend May and his dream of owning a motorcycle. Brandon's best friend is Michael, an ambitious and murderous dope peddler. Michael covets May and so he comes up with a plan that will win her for him, and solves a problem he's been having. It seems that an undercover cop named Sharky has been using his police connections to dominate the local cocaine trade, so Michael has him killed and uses Brandon as the fall guy. Brandon goes to jail, though he thinks that he will be released soon thanks to the efforts of his good buddy Michael. Eight years later Brandon finally gets out of jail and vows revenge."
    }
  ]
}
